/*Во рамките на текстуална датотека matrica.txt се сместени елементите (целобројни вредности) од една матрица (A).
Во првиот ред од датотеката се запишани бројот на редици n и бројот на колони m на матрицата (n, m < 120).
Потоа, во секој ред од датотеката се запишани елементите од соодветната редица на матрицата.
Да се испечати колку индексни броеви има во секоја колона поединечно.
Индексен број е број чија вредност е идентична со вредноста што се добива со спојување на индексот од редицата и колоната на елементот.
Помош:
Индексен елемент: вредноста на елементот Aij е иста со ij како број
- ако i=10, j=31, елементот Aij треба да има вредност 1031 за да биде индексен број

*/
#include<stdio.h>
#include<ctype.h>
#include<string.h>

void wtf() {
    FILE *f = fopen("matrica.txt", "w");
    char c;
    while((c = getchar()) != '#') {
        fputc(c, f);
    }
    fclose(f);
}

int main() {
    wtf();
   FILE *f = fopen("matrica.txt", "r");
   int i,j,n,m,mat[120][120],broj,brojach;
   fscanf(f,"%d %d",&n,&m);
   for(i=0;i<n;i++)
   {
       for(j=0;j<m;j++)
       {
           fscanf(f,"%d",&mat[i][j]);
       }
   }

   for(j=0;j<m;j++)
       {
           brojach=0;
   for(i=0;i<n;i++)
   {
       if(j<10)
           {
               broj=i*10+j;
           }
           else if(j>=10 && j<100)
           {
               broj=i*100+j;
           }
           else if(j>=100 && j<1000)
           {
               broj=i*1000+j;
           }
          if(mat[i][j]==broj)
          {
              brojach++;
          }
       }
        printf("%d\n",brojach);
   }
   fclose(f);



    return 0;
}
