/*Од стандарден влез се чита цел број N (N<100) и потоа N низи од знаци. Низите знаци содржат букви,
цифри и специјални знаци, а секоја од нив не е поголема од 50 знаци.
Да се напише програма што ќе ги отпечати на екран сите низи од знаци во кои се содржи поднизата А1c
најмалку 2 пати (пр. A1c01АA1c92, 12A1cwwA1cxy, аA1cwA1cA1ccA1cxab) според редоследот како што се прочитани од влезот.
При печатење на зборовите, сите алфабетски знаци треба да се испечатат со мали букви.
*/
#include<stdio.h>
#include<ctype.h>
#include<string.h>
int main()
{
    int i,n,j,br;
    char niza[51];
    scanf("%d",&n);
    for(i=0;i<n;i++)
    {
        scanf("%s",niza);
        br=0;
        for(j=0;j<strlen(niza);j++)
        {
            if(tolower(*(niza+j))=='a' && *(niza+j+1)=='1' && tolower(*(niza+j+2))=='c')
            {
                br++;
            }
        }
        if(br>=2)
        {
            for(j=0;j<strlen(niza);j++)
            {
                printf("%c",tolower(*(niza+j)));
            }
          printf("\n");
        }
    }
}
