/*Да се напише програма во која се вчитува матрица од цели броеви A со N редици и N * 2 колони (N не е поголемо од 50).
Програмата треба да ја трансформира вчитаната матрица во нова матрица B, така што сите елементи десно од
N-тата колона ќе ги префрли под N-тата редица, односно од матрица со димензија N редици и 2 * N колони
ќе се добие матрица со 2 * N редици x N колони.
*/
#include<stdio.h>
#define max 50
int main()
{
    int i,j,n,a[max][max*2],b[max*2][max],k=0,p;
    scanf("%d",&n);
    p=n;
    for(i=0;i<n;i++)
    {
        for(j=0;j<n*2;j++)
        {
            scanf("%d",&a[i][j]);
        }
    }
    for(i=0;i<n;i++)
    {
        for(j=0;j<n*2;j++)
        {
            if(j>=n)
            {
                b[p][k++]=a[i][j];
            }
            else
                b[i][j]=a[i][j];

        }
        k=0;
        p++;

    }
    for(i=0;i<n*2;i++)
    {
        for(j=0;j<n;j++)
        {
             printf("%d ",b[i][j]);
        }
        printf("\n");
    }
}
