/*Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата).
Притоа самиот елемент кој ја дели матрицата припаѓа во четвртиот квадрант (-5 во примерот на сликата).
Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100).
Потоа се внесуваат два броеви кои претставуваат индекси на еден елемент од матрицата.
Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез.
Притоа се печати сумата за првиот квадрант, па за вториот, па третиот и на крај за четвртиот.
Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.

*/

#include<stdio.h>
#define max 100
int main()
{
    int n,m,i,j,a[max][max],ii,jj,prv=0,vtor=0,tret=0,chetvrt=0;
    scanf("%d %d",&n,&m);
    for(i=0;i<n;i++)
    {
        for(j=0;j<m;j++)
        {
            scanf("%d",&a[i][j]);
        }
    }
    scanf("%d %d",&ii,&jj);
    for(i=0;i<ii;i++)
        {
            for(j=jj;j<m;j++)
            {
                prv+=a[i][j];
            }
        }
    for(i=0;i<ii;i++)
        {
            for(j=0;j<jj;j++)
            {
                vtor+=a[i][j];
            }
        }
    for(i=ii;i<n;i++)
        {
            for(j=0;j<jj;j++)
            {
                tret+=a[i][j];
            }
        }
        for(i=ii;i<n;i++)
        {
            for(j=jj;j<m;j++)
            {
                chetvrt+=a[i][j];
            }
        }
        printf("%d %d %d %d",prv,vtor,tret,chetvrt);
    return 0;
}
