/*Да се имплементира рекурзивна функција која за низа од цели броеви $[a{0}, a{1}, ..., a_{n-1}]$
ќе ја пресмета вредноста на непрекинатата дропка дефинирана како:
v=a0+1a1+...1an−2+1an−1
Да се напише програма во која се чита цел број N, по што се читаат елементите на низа од N цели броеви
(не повеќе од 100). Потоа се повикува рекурзивната функција и се печати резултатот во нов ред.

*/
#include<stdio.h>
float rekfunkcija(int niza[100],int n,int i)
{
    if(i==n)
    {
        return niza[i];
    }
    else
    {
        return (niza[i]+(1/rekfunkcija(niza,n,i+1)));
    }

}
int main()
{
    int i,n,niza[100];
    scanf("%d",&n);
    for(i=0;i<n;i++)
    {
        scanf("%d",&niza[i]);
    }
    printf("%.6f",rekfunkcija(niza,n-1,0));
    return 0;
}
