/*Од стандарден влез се чита еден природен број n. Меѓу природните броеви помали од n, да се најде оној чиј што збир на делителите е најголем.
Во пресметувањето на збирот на делителите на даден број, да не се зема предвид самиот број.

Input
10
Result
8
*/

#include<stdio.h>
int main ()
{
    int n,i,j,zbir=0,max=-9999,poz;
    scanf("%d",&n);
    for(i=1;i<n;i++)
    {
        zbir=0;
        for(j=1;j<=i/2;j++)
        {
            if(i%j==0)
            {
                zbir+=j;
            }
        }
        if(max<zbir)
        {
            max=zbir;
            poz=i;
        }
    }
    printf("%d",poz);
    return 0;
}
